#include	<stdio.h>
#include	<math.h>
#include	<string.h>
#include	"ComHansub.h"

//**************************************************************************************
//* 関数名　　:ireq_C
//* 概要  　　:数値の誤差範囲の比較
//* 詳細  　　:
//* 引数　　　:[I] 数値１
//* 　　　　　:[I] 数値２
//* 　　　　　:[I] 誤差
//* 戻り値　　:'=0：一致しない、=1：一致
//* 作成者　　:2022/10/08 FXS 葛
//* 更新者　　:20xx/xx/xx
//* 更新内容　:
//**************************************************************************************
int ireq_C(float f_v1, float f_v2, float f_k)
{
	// ==== R1911.9 = 2019/12/10 Alv.shin 汎用サブルーチン誤差対応
	float f_r_gosa = 0.0f;
	// ============== 2019/12/10 Alv.shin 汎用サブルーチン誤差対応
	int   i_ireq = 0;

	// ==== R1911.9 = 2019/12/10 Alv.shin 汎用サブルーチン誤差対応
	f_r_gosa = f_k;
	if (fabsf(f_r_gosa) < F_KIJUN) {
		f_r_gosa = F_KOYO_GOSA;
	}
	// ============== 2019/12/10 Alv.shin 汎用サブルーチン誤差対応
	// = R1302.0 hashi = 2013/02/05 ﾒﾝﾃ(No.#####)
	//   R1302.0  負の値に対応
	// ==== R1911.9 = 2019/12/10 Alv.shin 汎用サブルーチン誤差対応
	if (fabsf(f_v1 - f_v2) <= fabsf(f_r_gosa)) {
		i_ireq = 1;
	}
	// ============== 2019/12/10 Alv.shin 汎用サブルーチン誤差対応
	// ================= 2013/02/05 ﾒﾝﾃ(No.#####)
	return i_ireq;
}
